## PANDAS

* veri manipülasyonu ve veri analizi için yazılıştır
* ekonometrik ve finansal çalışmalar için doğmuştur
* numpy nin özelliklerini kullanan ve buları genişleten kütüphanedir
* birçok farklı veritipini barındırır

In [1]:
print("hello")

hello

# Pandas Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.Series([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
seri=pd.Series([1,2,3,4])

In [4]:
type(seri)

pandas.core.series.Series

In [5]:
seri.axes# hangi değerden nereye kadar gittiğini

[RangeIndex(start=0, stop=4, step=1)]

In [6]:
seri.dtype

dtype('int64')

In [7]:
seri.empty

False

In [8]:
seri.ndim

1

In [9]:
seri.size

4

In [10]:
seri.values#serinin degerlerine

array([1, 2, 3, 4], dtype=int64)

In [11]:
seri.head(2)

0    1
1    2
dtype: int64

In [13]:
seri.tail(2)

2    3
3    4
dtype: int64

In [14]:
seri[0:3]

0    1
1    2
2    3
dtype: int64

* Numpy array üzerinden seri oluşturmak

In [16]:
a=np.array([1,2,3,55,888])
a

array([  1,   2,   3,  55, 888])

In [17]:
type(a)

numpy.ndarray

In [21]:
seri=pd.Series(a)#numpy arrayini pandas serisine dönüstürdük
seri
type(seri)

pandas.core.series.Series

In [22]:
seri.index

RangeIndex(start=0, stop=5, step=1)

In [23]:
seri.values

array([  1,   2,   3,  55, 888])

In [25]:
seri[0]

1

In [26]:
#seriyi istediğimzi sırada olusturmak istersek

pd.Series([1,5,0.9,34],index=[1,3,5,7])

1     1.0
3     5.0
5     0.9
7    34.0
dtype: float64

In [29]:

seri2=pd.Series([1,5,0.9,34],index=['a','b','c','d'])

In [30]:
seri2["a"]#a indeksi 1 değerine karsılık gelir

1.0

* Sozluk üzerinden seri oluşturmak

In [31]:
sozluk={"reg":10,"loj":11,"cart":12}

In [32]:
sozluk

{'reg': 10, 'loj': 11, 'cart': 12}

In [34]:
seri3=pd.Series(sozluk)

In [35]:
seri3["reg"]

10

In [37]:
seri3["loj":"cart"]
#e kadara kadar bakılmaz bu keylere karşılık
#gelenleri bize getirir

loj     11
cart    12
dtype: int64

* İki seri üzerinden pandas serisi olusturmak

In [38]:
seri3

reg     10
loj     11
cart    12
dtype: int64

In [39]:
pd.concat([seri3,seri3])
#alt alta serileri birlestirdi

reg     10
loj     11
cart    12
reg     10
loj     11
cart    12
dtype: int64

In [40]:
seri3.append(seri3)

reg     10
loj     11
cart    12
reg     10
loj     11
cart    12
dtype: int64

# Serilerde Eleman İşlemleri

In [42]:
a=np.array([1,2,3,33,55,66])
seri=pd.Series(a)
seri

0     1
1     2
2     3
3    33
4    55
5    66
dtype: int32

In [43]:
seri[0]

1

In [44]:
seri[0:3]

0    1
1    2
2    3
dtype: int32

* Index isimlendirmelerine göre Eleman seçme işlemleri

In [50]:
seri=pd.Series([121,200,150,99],
              index=["reg","loj","cart","rf"])
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [51]:
seri.index# index degerlerine eristik

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [52]:
seri.keys

<bound method Series.keys of reg     121
loj     200
cart    150
rf       99
dtype: int64>

In [53]:
list(seri.items())
#degerlere ve indekslere beraber erismek icin

[('reg', 121), ('loj', 200), ('cart', 150), ('rf', 99)]

In [54]:
seri.values#degerlere erismek

array([121, 200, 150,  99], dtype=int64)

In [55]:
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [56]:
"knn" in seri# knn seride var mı -false -yok demek

False

In [57]:
"reg" in seri

True

In [58]:
seri["reg"]#indeks isminden değere ersitik

121

In [59]:
seri[["reg","rf"]]# fancy index

reg    121
rf      99
dtype: int64

In [61]:
seri["rf"]=125 #rf indeksinin degerini degistirdik
seri

reg     121
loj     200
cart    150
rf      125
dtype: int64

In [62]:
seri["loj":"rf"]

loj     200
cart    150
rf      125
dtype: int64

In [63]:
seri[0:2]

reg    121
loj    200
dtype: int64

* Koşullu Eleman İşlemleri

In [65]:
seri[(seri>125)& (seri<170)]

cart    150
dtype: int64

* serilerde index problemleri

In [66]:
data= pd.Series(['a','b','c'],index=([1,3,5]))
data

1    a
3    b
5    c
dtype: object

In [67]:
data[0]# key hatası alırız

KeyError: 0

In [68]:
data[1]

'a'

In [69]:
#indeksin tam olarak tanımlandıgı şekliyle olması gerekir

In [70]:
data[1:3]#slicing işlemi 
# a yı bize vermedi
#0 dan başlıyo gibi  çalıştı

3    b
5    c
dtype: object

In [71]:
data[0:3]

1    a
3    b
5    c
dtype: object

# loc label based indexing, 
# tanımlandığı sekliyle indeks yakalama

In [72]:
data.loc[1]

'a'

In [73]:
data.loc[2]#indeksilri tanımlama şekliyle yakalamak istiyorsak

KeyError: 2

In [74]:
data.loc[0:1]

1    a
dtype: object

In [75]:
data.loc[0:2]#verilen aralıkta yer alan indeksleri getirdi
# 3 indeksini barındırmadığı için 3 ü getirmedi

1    a
dtype: object

In [76]:
data.loc[0:3]

1    a
3    b
dtype: object

In [77]:
data.loc[0:4]
# 1 ve 3 . indekse karşılık gelen degerleri getirdi

1    a
3    b
dtype: object

# iloc positional indexing,
# indeksi sıfırlayarak yakalamak

In [78]:
data.iloc[0]

'a'

In [79]:
data.iloc[1]

'b'

In [80]:
data.iloc[2]

'c'

In [81]:
data.iloc[3]

IndexError: single positional indexer is out-of-bounds

In [82]:
data.iloc[0:3]

1    a
3    b
5    c
dtype: object

# Pandas DataFrame Özellikleri & Olusturma

* Liste Üzerinden DataFrame Oluşturmak ve DataFrame Özellikleri

In [83]:
l=[1,2,3,577,3430]
l

[1, 2, 3, 577, 3430]

In [84]:
pd.DataFrame(l,columns=['degisken_ismi'])

   degisken_ismi
0              1
1              2
2              3
3            577
4           3430

In [86]:
df=pd.DataFrame(l,columns=['degisken_ismi'])

In [87]:
type(df)

pandas.core.frame.DataFrame

In [88]:
df.axes

[RangeIndex(start=0, stop=5, step=1), Index(['degisken_ismi'], dtype='object')]

In [89]:
df.shape

(5, 1)

In [90]:
df.ndim

2

In [91]:
df.size

5

In [92]:
df.values

array([[   1],
       [   2],
       [   3],
       [ 577],
       [3430]], dtype=int64)

In [93]:
df.head()

   degisken_ismi
0              1
1              2
2              3
3            577
4           3430

In [94]:
df.tail(2)

   degisken_ismi
3            577
4           3430

* Numpy Arrayi Üzerinden Dataframe olusturmak

In [95]:
a=np.array([1,2,3,4,56])

In [96]:
pd.DataFrame(a,columns=["degisken_ismi"])

   degisken_ismi
0              1
1              2
2              3
3              4
4             56

In [101]:
import numpy as np
m=np.arange(1,10).reshape((3,3))
m# iki boyutlu array olustu

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [103]:
df=pd.DataFrame(m,columns=["var1","var2","var3"])

In [104]:
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

* degiskenleri isimlendirmek

In [106]:
df.columns# degiskenleri sectik

Index(['var1', 'var2', 'var3'], dtype='object')

In [107]:
df.columns=('deg1','deg2','deg3')

In [108]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

* indeksleri isimlendirmek

In [109]:
# indeksleri de isimlendirmek için
df=pd.DataFrame(m,columns=["var1","var2","var3"],index=['a','b','c'])

In [110]:
df

   var1  var2  var3
a     1     2     3
b     4     5     6
c     7     8     9

* pandas serisi üzerinden dataframe olusturmak

In [111]:
pd.Series([1,2,44,5,66])

0     1
1     2
2    44
3     5
4    66
dtype: int64

In [112]:
pd.DataFrame(pd.Series([1,2,44,5,66]),columns=["degisken"])

   degisken
0         1
1         2
2        44
3         5
4        66

* iki adet pandas serisiyle degisken olusturma

In [113]:
bir=pd.Series([1,2,3,4])
iki=pd.Series([5,6,7,8])

In [115]:
pd.DataFrame({'degisken1':bir,
              'degisken2':iki})

   degisken1  degisken2
0          1          5
1          2          6
2          3          7
3          4          8

* sozluk üzerinden dataframe olusturmak

In [117]:
sozluk={"reg":{"RMSE":10,
              "MSE":11,
              "SSE":90},
        "loj":{"RMSE":89,
              "MSE":12,
              "SSE":45},
        "cart":{"RMSE":45,
              "MSE":22,
              "SSE":11}}

In [118]:
pd.DataFrame(sozluk)

      reg  loj  cart
RMSE   10   89    45
MSE    11   12    22
SSE    90   45    11

## DataFrame Eleman İşlemleri

In [165]:
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)

df=pd.DataFrame({"var1":s1,
                "var2":s2,
                "var3":s3})
df

   var1  var2  var3
0     0     3     4
1     9     7     0
2     4     8     0
3     0     0     6
4     4     6     8

* gozlem secme islemleri

In [122]:
df[0:1]

   var1  var2  var3
0     2     5     5

In [161]:
df.index=['a','b','c','d','e']

In [125]:
df['c':'e']#indekslere göre secim yaptık

   var1  var2  var3
c     8     6     7
d     7     0     9
e     7     6     2

In [126]:
#indeks işlemlerine göre silme 
df.drop('a',axis=0)
#gözlemi sildi axis 0 satırı sildi

   var1  var2  var3
b     1     5     4
c     8     6     7
d     7     0     9
e     7     6     2

In [127]:
df# df e baktıgımda silme islemi gerceklesmemis 
#gözukuyo

   var1  var2  var3
a     2     5     5
b     1     5     4
c     8     6     7
d     7     0     9
e     7     6     2

In [128]:
df.drop('a',axis=0,inplace=True)
#inplace =True yaparak degisikligin kalıcı 
# olmasını sağlıyorum.
#yani a argumanı artık silinmis oluyor

In [130]:
df# a kesin olarak silindi

   var1  var2  var3
b     1     5     4
c     8     6     7
d     7     0     9
e     7     6     2

In [131]:
l=["b","c"] #birden fazla indeksi listeye attık

In [132]:
l

['b', 'c']

In [133]:
df.drop(l,axis=0)# birden fazla indeksi 
#silmeyi sağladık

   var1  var2  var3
d     7     0     9
e     7     6     2

In [134]:
df

   var1  var2  var3
b     1     5     4
c     8     6     7
d     7     0     9
e     7     6     2

* degiskenlere erismek ve degisken secim islemleri

In [135]:
'var1' in  df

True

In [136]:
l=['var1','var2','var4']

In [137]:
for i in l:
    print(i in df)

True
True
False

In [138]:
df['var1'] is df['var2']# varlık sorgulama

False

In [139]:
df['var1'] is df['var1']#varlık sorgulama

True

In [140]:
df['var2']#degisken secme yaklasimi
#sozluk secimi diye adlandirilir

b    5
c    6
d    0
e    6
Name: var2, dtype: int32

In [141]:
df.var2# degisken secme yaklasimi
#attribute tipi degisken secimi

b    5
c    6
d    0
e    6
Name: var2, dtype: int32

In [142]:
# birden fazla degiskeni secme islemi
df[['var1','var2']]

   var1  var2
b     1     5
c     8     6
d     7     0
e     7     6

In [145]:
l=['var1','var2']#sececegimiz degiskenleri listeye attik

In [146]:
df[l]# coklu degisken secimi yaptık

   var1  var2
b     1     5
c     8     6
d     7     0
e     7     6

In [154]:
# degisken eklemek istiyorum

df['var4']= df['var1']/df['var2']

In [148]:
df
#var4 ü var1 in var2 ye bölümünden olacak sekilde ekledim

   var1  var2  var3      var4
b     1     5     4  0.200000
c     8     6     7  1.333333
d     7     0     9       inf
e     7     6     2  1.166667

In [150]:
# degisken silmek
df.drop('var4',axis=1)
#axis=1 degisken yani sütun sildi
#silme islemini gerceklesti
#ama kalıcı olmadı 
#kalıcı olması için inplace=True olamalı

   var1  var2  var3
b     1     5     4
c     8     6     7
d     7     0     9
e     7     6     2

In [152]:
df
df.drop('var4',axis=1,inplace=True)
#inplace=True ile kalıcı olarak silindi

In [153]:
df

   var1  var2  var3
b     1     5     4
c     8     6     7
d     7     0     9
e     7     6     2

* birden fazla degiskeni yani sütunu aynı anda silmek 
* icin array olusturup o arrayi kullanarak 
* df.drop kullanıp için o arrayi koyuyoruz
* axis= 1 yapıp kalıcı silmek icinde inplace 
* yazıyoruz

In [155]:
l=['var1','var4']

In [156]:
df.drop(l,axis=1,inplace=True)

In [157]:
df

   var2  var3
b     5     4
c     6     7
d     0     9
e     6     2

# Gozlem ve Degiskenlere Birlikte Erismek

In [166]:
df

   var1  var2  var3
0     0     3     4
1     9     7     0
2     4     8     0
3     0     0     6
4     4     6     8

In [168]:
df.loc[0:3]# olusturulan indekse sabit kalarak 
#islem gerceklestiriyor

   var1  var2  var3
0     0     3     4
1     9     7     0
2     4     8     0
3     0     0     6

In [169]:
df.iloc[0:3]# 0 dan 3 e kadar

   var1  var2  var3
0     0     3     4
1     9     7     0
2     4     8     0

In [170]:
df.iloc[0,0]

0

In [172]:
df.iloc[0:3,0:2]
df.iloc[:3,:2]

   var1  var2
0     0     3
1     9     7
2     4     8

In [173]:
df.iloc[2:6,1:3]

   var2  var3
2     8     0
3     0     6
4     6     8

In [174]:
df.loc[0:3,'var3']

0    4
1    0
2    0
3    6
Name: var3, dtype: int32

In [175]:
df.loc[:3,'var2':'var3']

   var2  var3
0     3     4
1     7     0
2     8     0
3     0     6

In [179]:
#df[:3,'var2':'var3']# hata verir
df.iloc[:3,'var2':'var3']# hata verir
# Not: Var olan isimlendirmelere bağlı 
# kalacaksak loc ile secim yaparız

TypeError: cannot do slice indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [var2] of <class 'str'>

In [180]:
df.index=["a","b","c","d","e"]

In [181]:
df

   var1  var2  var3
a     0     3     4
b     9     7     0
c     4     8     0
d     0     0     6
e     4     6     8

In [183]:
df.iloc[0:3]#  iloc numpy arrayi seklindedir

   var1  var2  var3
a     0     3     4
b     9     7     0
c     4     8     0

* Kosullu Eleman İslemleri

In [187]:
df[df.var1.values>5]

   var1  var2  var3
b     9     7     0

In [188]:
df[df.var1.values>5]['var2']

b    7
Name: var2, dtype: int32

In [189]:
df[(df.var1>5) & (df.var3<7)]

   var1  var2  var3
b     9     7     0

In [193]:
#birden fazla degiskenide secmek istedigmizde bunu 
#kullanabiliriz
df.loc[df.var1.values>5,['var2','var1']]

   var2  var1
b     7     9

# Birlestirme (Join) İşlemleri

In [194]:
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)

df1=pd.DataFrame({"var1":s1,
                 "var2":s2,
                 "var3":s3})
df1

   var1  var2  var3
0     5     8     4
1     3     5     9
2     1     5     4
3     8     7     0
4     9     9     7

In [196]:
df2=df1+99# dataframe içindeki her bir degere 99 eklendi
df2

   var1  var2  var3
0   104   107   103
1   102   104   108
2   100   104   103
3   107   106    99
4   108   108   106

* concat ile birlestirme

In [197]:
import pandas as pd
pd.concat([df1,df2])
# satır bazında birlestirme islemi gerceklesti

   var1  var2  var3
0     5     8     4
1     3     5     9
2     1     5     4
3     8     7     0
4     9     9     7
0   104   107   103
1   102   104   108
2   100   104   103
3   107   106    99
4   108   108   106

In [198]:
# sütun bazında birlestirme yapmak istersem
pd.concat([df1,df2],axis=1)

   var1  var2  var3  var1  var2  var3
0     5     8     4   104   107   103
1     3     5     9   102   104   108
2     1     5     4   100   104   103
3     8     7     0   107   106    99
4     9     9     7   108   108   106

In [199]:
pd.concat([df1,df2])
#indeksleme problemi meydana geldi

   var1  var2  var3
0     5     8     4
1     3     5     9
2     1     5     4
3     8     7     0
4     9     9     7
0   104   107   103
1   102   104   108
2   100   104   103
3   107   106    99
4   108   108   106

In [200]:
pd.concat([df1,df2],ignore_index=True)
#indeks problemini ortadan kaldırmak
#icin ignore_index=True yaparız.
#Böylece index problemi ortadan kalkar

   var1  var2  var3
0     5     8     4
1     3     5     9
2     1     5     4
3     8     7     0
4     9     9     7
5   104   107   103
6   102   104   108
7   100   104   103
8   107   106    99
9   108   108   106

* iki dataframein degisken isimlerinin farklı oldugunu 
* dusunelim

In [202]:
df2.columns=["var1","var2","deg3"]
df2

   var1  var2  deg3
0   104   107   103
1   102   104   108
2   100   104   103
3   107   106    99
4   108   108   106

In [203]:
pd.concat([df1,df2])

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    deg3  var1  var2  var3
0    NaN     5     8   4.0
1    NaN     3     5   9.0
2    NaN     1     5   4.0
3    NaN     8     7   0.0
4    NaN     9     9   7.0
0  103.0   104   107   NaN
1  108.0   102   104   NaN
2  103.0   100   104   NaN
3   99.0   107   106   NaN
4  106.0   108   108   NaN

In [205]:
pd.concat([df1,df2],join='inner')
# nan degerleri almak istemiyorsak sadece 7
#kesisen yerleri almak istiyorsak join='inner'
#olarak tanımlarız

   var1  var2
0     5     8
1     3     5
2     1     5
3     8     7
4     9     9
0   104   107
1   102   104
2   100   104
3   107   106
4   108   108

In [206]:
#iki dataframei birlestirirken belli bir 
# degiskene göre birlestirme yapmak istersek
pd.concat([df1,df2],join_axes=[df1.columns])
# birinci dataframein degisken isimlerini 
#referans alarak birlestirme islemini gerceklestirdim

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  This is separate from the ipykernel package so we can avoid doing imports until

   var1  var2  var3
0     5     8   4.0
1     3     5   9.0
2     1     5   4.0
3     8     7   0.0
4     9     9   7.0
0   104   107   NaN
1   102   104   NaN
2   100   104   NaN
3   107   106   NaN
4   108   108   NaN

# merge ve join işlemleri

In [220]:
df1=pd.DataFrame({'calisanlar':['Ali','Veli','Ayse','Fatma'],
                 'grup':['Muhasebe','Muhendislik','Muhendislik','İK']})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [221]:
df2=pd.DataFrame({'calisanlar':['Ali','Veli','Ayse','Fatma'],
                 'ilk_giris':[2010,2009,2014,2005]})
df2

  calisanlar  ilk_giris
0        Ali       2010
1       Veli       2009
2       Ayse       2014
3      Fatma       2005

In [222]:
df4=pd.DataFrame({'grup':['Muhasebe','Muhendislik','İK'],
                 'mudur':['Caner','Mustafa','Berkcan']})
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           İK  Berkcan

In [223]:
df5=pd.DataFrame({'grup':['Muhasebe','Muhasebe','Muhendislik','Muhendislik','İK','İK'],
                 'yetenekler':['matematik','excel','kodlama','linux','excel','yonetim']})
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           İK      excel
5           İK    yonetim

* one to one birlestirme

In [224]:
# DURUM 1:
# df1 ve df2 birlestirme 
# tum elemanların iki verisetindede yer alması durumu

In [225]:
pd.merge(df1,df2)
# merge fonksiyonu birlestirmenin 
# hangi degiskene göre yapılcağını biliyor

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           İK       2005

In [226]:
pd.merge(df1,df2,on='calisanlar')
# hangi degiskene göre yapılacağını
#on ile veriyoruz

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           İK       2005

* many to one birlestirme

birinde tekrar olması digerinde 
tekrar olmaması durumu

In [228]:
df3= pd.merge(df1,df2)
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           İK       2005

In [229]:
df4=pd.DataFrame({'grup':['Muhasebe','Muhendislik','İK'],
                 'mudur':['Caner','Mustafa','Berkcan']})
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           İK  Berkcan

In [230]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2010    Caner
1       Veli  Muhendislik       2009  Mustafa
2       Ayse  Muhendislik       2014  Mustafa
3      Fatma           İK       2005  Berkcan

* many to many birlestirme

birlestirilecek ana degiskenlerin ikisindede çoklama olması durumu

In [231]:
df5=pd.DataFrame({'grup':['Muhasebe','Muhasebe','Muhendislik','Muhendislik','İK','İK'],
                 'yetenekler':['matematik','excel','kodlama','linux','excel','yonetim']})
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           İK      excel
5           İK    yonetim

In [232]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [233]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           İK      excel
7      Fatma           İK    yonetim

In [235]:
df3=pd.DataFrame({'name':['Ali','Veli','Ayse','Fatma'],
                 'maas':[7000,8000,12000,9000]})
df3

    name   maas
0    Ali   7000
1   Veli   8000
2   Ayse  12000
3  Fatma   9000

In [236]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [238]:
# df1 ve df3 ü birlestirmek
# birincisinde calisanlar name diye yer almıs ikincisinde 
# calisanlar olarak yer almıs
pd.merge(df1,df3,left_on='calisanlar',right_on='name')

# degisken isimlerinde coklama var aynı seyleri ifade ediyor

  calisanlar         grup   name   maas
0        Ali     Muhasebe    Ali   7000
1       Veli  Muhendislik   Veli   8000
2       Ayse  Muhendislik   Ayse  12000
3      Fatma           İK  Fatma   9000

In [240]:
pd.merge(df1,df3,left_on='calisanlar',right_on='name').drop('name',axis=1)
# bu sekilde aynı degiskenlere sahip olan name i silmis olduk

  calisanlar         grup   maas
0        Ali     Muhasebe   7000
1       Veli  Muhendislik   8000
2       Ayse  Muhendislik  12000
3      Fatma           İK   9000

* verisetlerini değilde indeksleri birlestirmek istersem

In [256]:
df1a=df1.set_index('calisanlar')
# df1 de calisanlar indeskisnin degerleri df1 in indeksi oldu

In [257]:
df1a

                   grup
calisanlar
Ali            Muhasebe
Veli        Muhendislik
Ayse        Muhendislik
Fatma                İK

In [258]:
df1.shape

(4, 2)

In [259]:
df1a.shape

(4, 1)

In [260]:
# not: bir degiskenin degerlerini gozlem isimleri olarak atadık

In [268]:
df2

  calisanlar  ilk_giris
0        Ali       2010
1       Veli       2009
2       Ayse       2014
3      Fatma       2005

In [269]:
df2a=df2.set_index('calisanlar')

In [270]:
df2a

            ilk_giris
calisanlar
Ali              2010
Veli             2009
Ayse             2014
Fatma            2005

In [271]:
# amacımız birlestirme islemini indeksler bazında yapmak

pd.merge(df1a,df2a,left_index=True,right_index=True)

                   grup  ilk_giris
calisanlar
Ali            Muhasebe       2010
Veli        Muhendislik       2009
Ayse        Muhendislik       2014
Fatma                İK       2005

In [272]:
df1a.join(df2a)# join birlestirme islemlerini indexe göre yapar
#indeskleri kesistirerek birlestirme islemi yapar

                   grup  ilk_giris
calisanlar
Ali            Muhasebe       2010
Veli        Muhendislik       2009
Ayse        Muhendislik       2014
Fatma                İK       2005

In [274]:
# overlapping 
dfa=pd.DataFrame({'calisanlar':['Ali','Veli','Ayse','Fatma'],
                 'siralama':[1,2,3,4]})
dfa

  calisanlar  siralama
0        Ali         1
1       Veli         2
2       Ayse         3
3      Fatma         4

In [275]:
dfb=pd.DataFrame({'calisanlar':['Ali','Veli','Ayse','Fatma'],
                 'siralama':[3,1,4,2]})
dfb

  calisanlar  siralama
0        Ali         3
1       Veli         1
2       Ayse         4
3      Fatma         2

In [278]:
pd.merge(dfa,dfb,on='calisanlar')# bu bir problemdir!!!!!!!!!!

  calisanlar  siralama_x  siralama_y
0        Ali           1           3
1       Veli           2           1
2       Ayse           3           4
3      Fatma           4           2

In [280]:
pd.merge(dfa,dfb,on='calisanlar',suffixes=['_Maas','_Deneyim'])

  calisanlar  siralama_Maas  siralama_Deneyim
0        Ali              1                 3
1       Veli              2                 1
2       Ayse              3                 4
3      Fatma              4                 2

# Aggregation ve Gruplama
aggregation: özetleme toplulastırma

In [282]:
import seaborn as sns

In [284]:
df=sns.load_dataset('planets')
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [285]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [286]:
df.shape

(1035, 6)

In [287]:
df.count()# her bir degiskeni bize saydırdı

method            1035
number            1035
orbital_period     992
mass               513
distance           808
year              1035
dtype: int64

In [288]:
df['mass']

0        7.10
1        2.21
2        2.60
3       19.40
4       10.50
        ...
1030      NaN
1031      NaN
1032      NaN
1033      NaN
1034      NaN
Name: mass, Length: 1035, dtype: float64

In [289]:
df['mass'].count()

513

In [291]:
df.describe().T #MEAN STD MİN  # describe özet istatistiki bize getirir

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

* count()
* first()
* last()
* mean()
* median()
* min()
* max()
* std()
* var()

In [292]:
df['mass'].describe()# bir degisken icin calıstırdık

count    513.000000
mean       2.638161
std        3.818617
min        0.003600
25%        0.229000
50%        1.260000
75%        3.040000
max       25.000000
Name: mass, dtype: float64

In [293]:
df.mean()# veriseti içindeki bütün degiskenlerin ortalamasını getirdi

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [294]:
df['distance'].mean()

264.06928217821786

In [297]:
df.dropna().describe().T # Önemli Kullanım

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

# Gruplama İşlemleri

In [301]:
df=pd.DataFrame({'gruplar':['A','B','C','A','B','C'],
                'veri':[10,11,52,23,43,55]},columns=['gruplar','veri'])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [302]:
df.groupby('gruplar')# ilk önce gruplar

In [303]:
df.groupby('gruplar').sum()# sonrasında aggregationla birlesip sonuc döndürür

         veri
gruplar
A          33
B          54
C         107

In [305]:
df=sns.load_dataset('planets')
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [306]:
df.groupby('method')['orbital_period']

In [307]:
df.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [308]:
# method: kategorik degiskenin orbital_period:sürekli degisken
# bu sürekli degiskenin kategorik degisken kırılımındaki medyan degerini 
#getirmis oldu

In [309]:
# Onemli *****************************
#tek bir istatistği değilde özet istatistiği almak istiyorum
df.groupby('method')['orbital_period'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

# Aggregate ,filter, transform,apply

* Aggregate Fonksiyonu

In [3]:
import numpy as np
import pandas as pd


df=pd.DataFrame({'gruplar':['A','B','C','A','B','C'],
                'degisken1':[10,23,33,22,11,99],
                'degisken2':[100,253,333,262,111,969]},
               columns=['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [ ]:
# Amac: Verisetini gruplara göre bölerek
#aggregate fonk kullanarakdegisken bazında 
#yani her degiskene özel min max ve median 
#degerlerine ulasalım

In [4]:
df.groupby('gruplar').aggregate(['min',np.median,max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10     16  22       100    181  262
B              11     17  23       111    182  253
C              33     66  99       333    651  969

In [ ]:
# degiskene özel hangi işlemin yapılacağınıda belirtebiliyorum

In [6]:
df.groupby('gruplar').aggregate({'degisken1':'mean','degisken2':'max'})

         degisken1  degisken2
gruplar
A               16        262
B               17        253
C               66        969

* Filter Fonksiyonu

In [19]:
def filter_func(x):
    return x['degisken1'].std()>9

In [20]:
df.groupby('gruplar').filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

* Transform Fonksiyonu

In [23]:
df.groupby('gruplar').transform(lambda x : (x-x.mean())/ x.std())

   degisken1  degisken2
0  -0.707107  -0.707107
1   0.707107   0.707107
2  -0.707107  -0.707107
3   0.707107   0.707107
4  -0.707107  -0.707107
5   0.707107   0.707107

* Apply Fonksiyonu

In [27]:
df.groupby('gruplar').apply(np.sum)
df.groupby('gruplar').apply(np.mean)

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

In [31]:
df.groupby(df['gruplar']).sum()# apply olmadanda 
#bu işlem gerçekleşir ama apply la daha hızl gerceklesir

         degisken1  degisken2
gruplar
A               32        362
B               34        364
C              132       1302

In [32]:
l=[0,1,0,1,2,0]

In [33]:
df.groupby(l).sum()

   degisken1  degisken2
0        142       1402
1         45        515
2         11        111

In [34]:
df.groupby(df['gruplar']).sum()

         degisken1  degisken2
gruplar
A               32        362
B               34        364
C              132       1302

# Pivot Tablolar

* groupby ın çok boyutlu versiyonu olarak düsünülebilir

In [36]:
import pandas as pd 
import seaborn as sns 
df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [37]:
# basit pivot islemi
#sex:cinsiyet - kategorik degisken
#survived: sag kalma durumu - kategorik degisken
df.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [40]:
df.groupby(['sex','class'])['survived'].mean()

df.groupby(['sex','class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [41]:
df.pivot_table('survived',index='sex',columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [42]:
df.pivot_table('survived',index='who',columns='alive')

alive  no  yes
who
child   0    1
man     0    1
woman   0    1

In [45]:
# çok boyutlu pivot table 
age=pd.cut(df['age'],[0,18,90]) #age surekli
#degiskeni kategorik degiskene cevrildi
#
age

0      (18.0, 90.0]
1      (18.0, 90.0]
2      (18.0, 90.0]
3      (18.0, 90.0]
4      (18.0, 90.0]
           ...
886    (18.0, 90.0]
887    (18.0, 90.0]
888             NaN
889    (18.0, 90.0]
890    (18.0, 90.0]
Name: age, Length: 891, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [47]:

# cok boyutlu pivota örnek
# satırlara age sayesinde boyut ekledik
df.pivot_table('survived',['sex',age],'class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

In [49]:
# sutunlara boyut ekleyelim
#surekli degiskeni kategorik degiskene cevirdik

fare=pd.qcut(df['fare'],2)
fare

0       (-0.001, 14.454]
1      (14.454, 512.329]
2       (-0.001, 14.454]
3      (14.454, 512.329]
4       (-0.001, 14.454]
             ...
886     (-0.001, 14.454]
887    (14.454, 512.329]
888    (14.454, 512.329]
889    (14.454, 512.329]
890     (-0.001, 14.454]
Name: fare, Length: 891, dtype: category
Categories (2, interval[float64]): [(-0.001, 14.454] < (14.454, 512.329]]

In [50]:
df.pivot_table('survived',['sex',age],[fare,'class'])

fare            (-0.001, 14.454]                     (14.454, 512.329]  \
class                      First    Second     Third             First
sex    age
female (0, 18]               NaN  1.000000  0.714286          0.909091
       (18, 90]              NaN  0.880000  0.444444          0.972973
male   (0, 18]               NaN  0.000000  0.260870          0.800000
       (18, 90]              0.0  0.098039  0.125000          0.391304

fare
class              Second     Third
sex    age
female (0, 18]   1.000000  0.318182
       (18, 90]  0.914286  0.391304
male   (0, 18]   0.818182  0.178571
       (18, 90]  0.030303  0.192308

In [51]:
#satırları önce cinsiyete göre sonra yasa göre bolduk
#sutunlara da classlara göre bölüp başka bir kırılıma daha böldük

In [52]:
df.pivot_table(index='sex',columns='class',
              aggfunc={'survived':sum,
                      'fare':min})

           fare              survived
class     First Second Third    First Second Third
sex
female  25.9292   10.5  6.75       91     70    72
male     0.0000    0.0  0.00       45     17    47

In [55]:
#marginlere toplamlarıda ekledik
df.pivot_table('survived',index='sex',columns='class',margins=True)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

# R- Dplyr Tarzı Veri Manipülasyonu

In [56]:
#dısardan kütüphane indirme islemi gerceklesti
!pip install dfply

Collecting dfply
  Downloading https://files.pythonhosted.org/packages/53/91/18ab48c64661252dadff685f8ddbc6f456302923918f488714ee2345d49b/dfply-0.3.3-py3-none-any.whl (612kB)
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (from dfply) (0.25.1)
Requirement already satisfied: numpy in c:\programdata\anaconda3\lib\site-packages (from dfply) (1.16.5)
Requirement already satisfied: pytz>=2017.2 in c:\programdata\anaconda3\lib\site-packages (from pandas->dfply) (2019.3)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\programdata\anaconda3\lib\site-packages (from pandas->dfply) (2.8.0)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas->dfply) (1.12.0)
Installing collected packages: dfply
Successfully installed dfply-0.3.3

In [57]:
from dfply import * # tum fnksiyonları kullanabilirm

In [58]:
# %>% ile >> pythonda aynı anlama gelir
# pipe operatörü

In [59]:
diamonds # r daki veri seti

       carat        cut color clarity  depth  table  price     x     y     z
0       0.23      Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1       0.21    Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2       0.23       Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3       0.29    Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4       0.31       Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75
...      ...        ...   ...     ...    ...    ...    ...   ...   ...   ...
53935   0.72      Ideal     D     SI1   60.8   57.0   2757  5.75  5.76  3.50
53936   0.72       Good     D     SI1   63.1   55.0   2757  5.69  5.75  3.61
53937   0.70  Very Good     D     SI1   62.8   60.0   2757  5.66  5.68  3.56
53938   0.86    Premium     H     SI2   61.0   58.0   2757  6.15  6.12  3.74
53939   0.75      Ideal     D     SI2   62.2   55.0   2757  5.83  5.87  3.64

[53940 rows x 10 columns]

* chain- pipe operatoru (>>)

In [65]:
df=diamonds.copy()
df.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [62]:
df>> head()
# >> pipe operatoru

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [63]:
# df>>=head()# bu islemi df in icine kaydediyor
#artık df degisiyor
#>> pipe operatorü, >>= ise atama islemi yapar

In [66]:
df.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

* degisken secme islemleri

In [67]:
# X dataframe e karsılık gelir
df >> select(X.carat,X.cut)>>head()

   carat      cut
0   0.23    Ideal
1   0.21  Premium
2   0.23     Good
3   0.29  Premium
4   0.31     Good

In [69]:
#x ve y degisken isimleri
df >> select(1,X.price,['x','y'])>>head(3)

       cut  price     x     y
0    Ideal    326  3.95  3.98
1  Premium    326  3.89  3.84
2     Good    327  4.05  4.07

In [70]:
df>> select(starts_with('c'))>>head(3)

   carat      cut color clarity
0   0.23    Ideal     E     SI2
1   0.21  Premium     E     SI1
2   0.23     Good     E     VS1

In [71]:
df>>select(ends_with('y'))>>head(3)

  clarity     y
0     SI2  3.98
1     SI1  3.84
2     VS1  4.07

In [72]:
df>> select(contains('y'))>>head(3)

  clarity     y
0     SI2  3.98
1     SI1  3.84
2     VS1  4.07

In [73]:
df>> select(columns_between('cut','table'))>>head(3)

       cut color clarity  depth  table
0    Ideal     E     SI2   61.5   55.0
1  Premium     E     SI1   59.8   61.0
2     Good     E     VS1   56.9   65.0

In [75]:
#degisken secerken X.price şeklindede yapabiliyoruz
#aynı zmanada ['degiskenismi','digerdegisken']
#seklindede secim yapabiliyoruz
df >> drop(1,X.price,['x','y'])>>head(3)

   carat color clarity  depth  table     z
0   0.23     E     SI2   61.5   55.0  2.43
1   0.21     E     SI1   59.8   61.0  2.31
2   0.23     E     VS1   56.9   65.0  2.31

In [76]:
#sectigimiz degiskenler dısındakileri secmek istersek
# ~ işareti koyarız
df>>select(~X.carat,~X.color)>>head(3)

       cut clarity  depth  table  price     x     y     z
0    Ideal     SI2   61.5   55.0    326  3.95  3.98  2.43
1  Premium     SI1   59.8   61.0    326  3.89  3.84  2.31
2     Good     VS1   56.9   65.0    327  4.05  4.07  2.31

In [77]:
df>>row_slice([10,15])# 10. ve 15. degerlere 
#karsılık gelen rowları bize getirdi

    carat      cut color clarity  depth  table  price     x     y     z
10   0.30     Good     J     SI1   64.0   55.0    339  4.25  4.28  2.73
15   0.32  Premium     E      I1   60.9   58.0    345  4.38  4.42  2.68

In [78]:
df>>row_slice([10])# 10.rowu getirir

    carat   cut color clarity  depth  table  price     x     y     z
10    0.3  Good     J     SI1   64.0   55.0    339  4.25  4.28  2.73

In [79]:
df>> group_by('cut')>>row_slice(5)
#her deger icin 5. degeri yakaladı.
#fair için 5.deger
#good icin 5.deger
#ıdeal icin 5.deger

     carat        cut color clarity  depth  table  price     x     y     z
128   0.91       Fair     H     SI2   64.4   57.0   2763  6.11  6.09  3.93
20    0.30       Good     I     SI2   63.3   56.0    351  4.26  4.30  2.71
40    0.33      Ideal     I     SI2   61.2   56.0    403  4.49  4.50  2.75
26    0.24    Premium     I     VS1   62.5   57.0    355  3.97  3.94  2.47
21    0.23  Very Good     E     VS2   63.8   55.0    352  3.85  3.92  2.48

In [81]:
df>>sample(frac=0.001,replace=False)>>head(3)

       carat        cut color clarity  depth  table  price     x     y     z
2703    0.31      Ideal     G     VS2   61.1   57.0    562  4.37  4.40  2.68
37488   0.35      Ideal     E     VS2   62.5   55.0    984  4.52  4.50  2.82
13995   1.20  Very Good     G     SI2   62.0   60.0   5698  6.78  6.76  4.20

In [82]:
df>>sample(n=3,replace=False)>>head(3)

       carat        cut color clarity  depth  table  price     x     y     z
22471   1.69  Very Good     I     SI1   61.8   60.0  10497  7.58  7.61  4.69
36327   0.32    Premium     G    VVS2   60.9   61.0    936  4.41  4.39  2.68
6547    1.01       Good     H     SI2   63.7   55.0   4072  6.37  6.32  4.04

In [83]:
df>>sample(n=4,replace=True)>>head(3)

       carat        cut color clarity  depth  table  price     x     y     z
45450   0.51      Ideal     D     VS2   61.5   56.0   1674  5.21  5.17  3.19
41219   0.43      Ideal     G    VVS1   61.5   56.0   1207  4.85  4.87  2.99
32033   0.31  Very Good     F    VVS1   59.4   57.0    779  4.39  4.43  2.62

In [84]:
df>>distinct(X.color)

    carat        cut color clarity  depth  table  price     x     y     z
0    0.23      Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
3    0.29    Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4    0.31       Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75
7    0.26  Very Good     H     SI1   61.9   55.0    337  4.07  4.11  2.53
12   0.22    Premium     F     SI1   60.4   61.0    342  3.88  3.84  2.33
25   0.23  Very Good     G    VVS2   60.4   58.0    354  3.97  4.01  2.41
28   0.23  Very Good     D     VS2   60.5   61.0    357  3.96  3.97  2.40

In [86]:
#gozlem indirgeme islemleri 
df>>mask(X.cut=='Ideal')>>head()

    carat    cut color clarity  depth  table  price     x     y     z
0    0.23  Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
11   0.23  Ideal     J     VS1   62.8   56.0    340  3.93  3.90  2.46
13   0.31  Ideal     J     SI2   62.2   54.0    344  4.35  4.37  2.71
16   0.30  Ideal     I     SI2   62.0   54.0    348  4.31  4.34  2.68
39   0.33  Ideal     I     SI2   61.8   55.0    403  4.49  4.51  2.78

In [87]:
#birden fazla kısıtı filtreleme yaptık

df>>mask(X.cut=='Ideal',X.color=='E',X.table<55,X.price<500)>>head()

       carat    cut color clarity  depth  table  price     x     y     z
26683   0.33  Ideal     E     SI2   62.2   54.0    427  4.44  4.46  2.77
32297   0.34  Ideal     E     SI2   62.4   54.0    454  4.49  4.52  2.81
40928   0.30  Ideal     E     SI1   61.6   54.0    499  4.32  4.35  2.67
50623   0.30  Ideal     E     SI2   62.1   54.0    401  4.32  4.35  2.69
50625   0.30  Ideal     E     SI2   62.0   54.0    401  4.33  4.35  2.69

In [88]:
# mask in karsılıgı filter_by da koyabiliriz
df>>filter_by(X.cut=='Ideal',X.color=='E',X.table<55,X.price<500)>>head()

       carat    cut color clarity  depth  table  price     x     y     z
26683   0.33  Ideal     E     SI2   62.2   54.0    427  4.44  4.46  2.77
32297   0.34  Ideal     E     SI2   62.4   54.0    454  4.49  4.52  2.81
40928   0.30  Ideal     E     SI1   61.6   54.0    499  4.32  4.35  2.67
50623   0.30  Ideal     E     SI2   62.1   54.0    401  4.32  4.35  2.69
50625   0.30  Ideal     E     SI2   62.0   54.0    401  4.33  4.35  2.69

## Degisken Dönüstürme İslemleri

In [89]:
#mutate fonk yeni bir degisken olusturmak istedigimizde kullanılır
df>>mutate(x_plus=X.x+X.y)>>head(3)
#x_plus=x ve y nin toplamından olusan yeni bir degiskendir

   carat      cut color clarity  depth  table  price     x     y     z  x_plus
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43    7.93
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31    7.73
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31    8.12

In [90]:
#columns_from('x') diyerek x den sonrakileri al dedik
df>>mutate(x_plus=X.x+X.y)>>select(columns_from('x'))>>head()

      x     y     z  x_plus
0  3.95  3.98  2.43    7.93
1  3.89  3.84  2.31    7.73
2  4.05  4.07  2.31    8.12
3  4.20  4.23  2.63    8.43
4  4.34  4.35  2.75    8.69

In [95]:
# iki yeni degisken olusturduk
df>>mutate(x_plus=X.x+X.y,y_div_z=(X.y/X.z))>>select(columns_from('x'))>>head(3)

      x     y     z  x_plus   y_div_z
0  3.95  3.98  2.43    7.93  1.637860
1  3.89  3.84  2.31    7.73  1.662338
2  4.05  4.07  2.31    8.12  1.761905

In [96]:
# verisetinde sadece bu olusturulan yeni degiskenlerin
#kalmasını istersek transmute fonksiyonu kullanılır

df>>transmute(x_plus=X.x+X.y,y_div_z=(X.y/X.z))>>head(3)

# sadece yeni olusturdugum degiskenler yer alır

   x_plus   y_div_z
0    7.93  1.637860
1    7.73  1.662338
2    8.12  1.761905

# Group by arrange summarize işlemleri

In [98]:
#eger arrage in icinde ascending=False dersek büyükten küçüğe sıralanmısolur
df>>group_by(X.cut)>> arrange(X.price,ascending=False)

       carat        cut color clarity  depth  table  price      x      y     z
27646   2.01       Fair     G     SI1   70.6   64.0  18574   7.43   6.64  4.69
27643   2.02       Fair     H     VS2   64.5   57.0  18565   8.00   7.95  5.14
27630   4.50       Fair     J      I1   65.8   58.0  18531  10.23  10.16  6.72
27623   2.00       Fair     G     VS2   67.6   58.0  18515   7.65   7.61  5.16
27543   2.51       Fair     H     SI2   64.7   57.0  18308   8.44   8.50  5.48
...      ...        ...   ...     ...    ...    ...    ...    ...    ...   ...
19      0.30  Very Good     J     SI1   62.7   59.0    351   4.21   4.27  2.66
9       0.23  Very Good     H     VS1   59.4   61.0    338   4.00   4.05  2.39
7       0.26  Very Good     H     SI1   61.9   55.0    337   4.07   4.11  2.53
6       0.24  Very Good     I    VVS1   62.3   57.0    336   3.95   3.98  2.47
5       0.24  Very Good     J    VVS2   62.8   57.0    336   3.94   3.96  2.48

[53940 rows x 10 columns]

In [100]:
#ungroup ile grup bozma islemi yaparız
#mask ile fitreleme yaparız

df>>group_by(X.cut)>> arrange(X.price)>>ungroup()>>mask(X.carat>0.23)

       carat        cut color clarity  depth  table  price     x     y     z
28270   0.25       Fair     E     VS1   55.2   64.0    361  4.21  4.23  2.33
31615   0.27       Fair     E     VS1   66.4   58.0    371  3.99  4.02  2.66
10030   0.30       Fair     J     VS2   64.8   58.0    416  4.24  4.16  2.72
40591   0.30       Fair     F     SI1   63.1   58.0    496  4.30  4.22  2.69
40597   0.34       Fair     J     SI1   64.5   57.0    497  4.38  4.36  2.82
...      ...        ...   ...     ...    ...    ...    ...   ...   ...   ...
27729   2.00  Very Good     F     SI1   57.9   60.0  18759  8.28  8.34  4.81
27733   1.51  Very Good     F    VVS1   62.6   59.0  18777  7.33  7.24  4.56
27736   2.03  Very Good     H     SI1   63.0   60.0  18781  8.00  7.93  5.02
27745   2.00  Very Good     H     SI1   62.8   57.0  18803  7.95  8.00  5.01
27748   2.00  Very Good     G     SI1   63.5   56.0  18818  7.90  7.97  5.04

[53621 rows x 10 columns]

* summarize fonksiyonu

In [101]:
#df in içerisindeki price degiskeninin 
#mean ve standart sapma degerlerini 
# özetlemis oldu
df>> summarize(price_ort=X.price.mean(),price_ss=X.price.std())

     price_ort     price_ss
0  3932.799722  3989.439738

In [102]:
df>> group_by('cut')>>summarize(price_ort=X.price.mean(),price_ss=X.price.std())

         cut    price_ort     price_ss
0       Fair  4358.757764  3560.386612
1       Good  3928.864452  3681.589584
2      Ideal  3457.541970  3808.401172
3    Premium  4584.257704  4349.204961
4  Very Good  3981.759891  3935.862161

## Dış Kaynaklı Verileri Okuma

In [1]:
pwd # dizin bakmak

'C:\\Users\\asus3561\\Desktop\\python_veri_bilimi'

In [2]:
import pandas as pd

In [4]:
#ön tanımlı ayrac degeri normalde ,
#ama bizim verisetinin ayracı ; seklindedir
# u nedenle sep=';' yapıyoruz
pd.read_csv('reading_data/ornekcsv.csv',sep=';')

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [5]:
# txt formatındaki veriyi okuma
pd.read_csv('reading_data/duz_metin.txt')

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [6]:
#excel formatındaki veriyi okuma
pd.read_excel('reading_data/ornekx.xlsx')

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0